         FD FitxerPassword
           LABEL RECORD IS STANDARD
           DATA RECORD IS Clau.
         01 Clau.
           02 Password  PIC X(5).
           02 NomUsuari PIC X(7).
