            SELECT CatalegViatges ASSIGN TO RANDOM "CATVIAT.AGV"
            ORGANIZATION IS INDEXED
            RECORD KEY IS CodiViatge
            ACCESS MODE IS DYNAMIC
            FILE STATUS IS EstatCatalegViatges.
