           SELECT FitxerPassword ASSIGN TO RANDOM "PASSWORD.AGV"
            ORGANIZATION IS INDEXED
            RECORD KEY IS Password
            ACCESS MODE IS DYNAMIC
            FILE STATUS IS EstatFitxerPassword.
