           SELECT FitxerReserves ASSIGN TO RANDOM "RESERVES.AGV"
            ORGANIZATION IS INDEXED
            RECORD KEY IS Clau
            ACCESS MODE IS DYNAMIC
            FILE STATUS IS EstatFitxerReserves.
